glcloud/keil_v5/ARM/PACK/.Web/Maxim.MAX32630.pdsc
      <example name="I2C_Loopback" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32630_EVKIT/I2C_Loopback">
         <description>I2C Loopback Demo Using the I2C Master and Slave Libraries</description>
         <board name="MAX32630_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/I2C_Loopback.uvprojx"/>
            <environment name="iar" load="IAR/I2C_Loopback.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32630 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="4.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="I2C Slave"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32630 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>I2C</keyword>
            <keyword>I2C Master</keyword>
            <keyword>I2C Slave</keyword>
         </attributes>
      </example>

      <example name="LP_GPIO" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32630_EVKIT/LP_GPIO">
         <description>Low Power Modes with wake up from GPIO</description>
         <board name="MAX32630_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/LP_GPIO.uvprojx"/>
            <environment name="iar" load="IAR/LP_GPIO.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32630 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="4.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="I2C Slave"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32630 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>Low Power</keyword>
            <keyword>External Interrupts</keyword>
            <keyword>Wakeup</keyword>
         </attributes>
      </example>

      <example name="LP_PMU" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32630_EVKIT/LP_PMU">
         <description>Low Power Modes using the Smart DMA (Peripheral Management Unit)</description>
         <board name="MAX32630_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/LP_PMU.uvprojx"/>
            <environment name="iar" load="IAR/LP_PMU.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32630 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="4.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="PMU"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="I2C Slave"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32630 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>Periperal Management Unit</keyword>
            <keyword>DMA</keyword>
         </attributes>
      </example>

      <example name="LP_RTC" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32630_EVKIT/LP_RTC">
         <description>Low Power Modes with RTC Wakeup</description>
         <board name="MAX32630_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/LP_RTC.uvprojx"/>
            <environment name="iar" load="IAR/LP_RTC.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32630 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="4.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="RTC"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32630 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>Real-Time Clock</keyword>
            <keyword>Low Power</keyword>
            <keyword>Wakeup</keyword>
         </attributes>
      </example>

      <example name="LP_UART" doc="IAR/Abstract.txt" folder="Boards/Maxim/MAX32630_EVKIT/LP_UART">
         <description>Low Power Modes with UART Wakeup</description>
         <board name="MAX32630_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="rx/ARM/LP_UART_RX.uvprojx"/>
            <environment name="iar" load="IAR/LP_UART_Workspace.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32630 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="4.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cbundle="MAX32630 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="Timers"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <keyword>Getting Started</keyword>
            <keyword>Real-Time Clock</keyword>
            <keyword>Low Power</keyword>
            <keyword>Wakeup</keyword>
         </attributes>
      </example>

      <example name="LP_WakeupTime" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32630_EVKIT/LP_WakeupTime">
         <description>Low Power Modes 0 and 1 wake up time measurement.</description>
         <board name="MAX32630_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/LP_WakeupTime.uvprojx"/>
            <environment name="iar" load="IAR/LP_WakeupTime.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32630 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="4.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32630 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>Low Power</keyword>
            <keyword>Wakeup</keyword>
            <keyword>GPIO</keyword>
            <keyword>External Interrupts</keyword>
         </attributes>
      </example>

