glcloud/keil_v5/ARM/PACK/.Web/Maxim.MAX32630.pdsc
   </examples>

   <conditions>
      <condition id="MAX32630 Device">
         <description> Maxim Integrated MAX32630 device family</description>
         <require Dvendor="Maxim:23"/>
         <require Dname="MAX32630"/>
      </condition>
      <condition id="MAX32631 Device">
         <description> Maxim Integrated MAX32631 device</description>
         <require Dvendor="Maxim:23"/>
         <require Dname="MAX32631"/>
      </condition>

      <condition id="MAX3263X CMSIS-CORE">
         <description>Maxim MAX32630 Series devices and CMSIS-CORE</description>
         <accept Cgroup="CORE" Cclass="CMSIS" Cversion="4.1.0"/>
         <accept Cgroup="CORE" Cclass="CMSIS" Cversion="4.1.1"/>
         <accept Cgroup="CORE" Cclass="CMSIS" Cversion="4.2.0"/>
         <accept Cgroup="CORE" Cclass="CMSIS" Cversion="4.3.0"/>
         <accept Cgroup="CORE" Cclass="CMSIS" Cversion="4.4.0"/>
         <accept Cgroup="CORE" Cclass="CMSIS" Cversion="4.5.0"/>
         <accept condition="MAX32630 Device"/>
         <accept condition="MAX32631 Device"/>
         <require Cclass="Device" Cgroup="Startup"/>
      </condition>

      <condition id="Startup ARM">
         <description>Startup files for the Keil/ARMCC Toolchains</description>
         <require Tcompiler="ARMCC"/>
      </condition>

      <condition id="Startup GCC">
         <description>Startup files for the GNU C Toolchain</description>
         <require Tcompiler="GCC"/>
      </condition>

      <condition id="Startup IAR">
         <description>Startup files for the IAR Embedded Workbench Toolchain</description>
         <require Tcompiler="IAR"/>
      </condition>

      <condition id="MAX32630 CMSIS ADC">
         <description>ADC Interface</description>
         <require Dvendor="Maxim:23"/>
         <require condition="MAX3263X CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32630 CMSIS AES">
         <description>Advanced Encryption Standard</description>
         <require condition="MAX3263X CMSIS-CORE"/>
      </condition>

      <condition id="MAX32630 CMSIS CRC">
         <description>Advanced Encryption Standard</description>
         <require condition="MAX3263X CMSIS-CORE"/>
      </condition>

      <condition id="MAX32630 CMSIS GPIO">
         <description>GPIO Interface Layer</description>
         <require condition="MAX3263X CMSIS-CORE"/>
      </condition>

      <condition id="MAX32630 CMSIS I2C Master">
         <description>I2C Master Interface</description>
         <require condition="MAX3263X CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>


      </condition>
      <condition id="MAX32630 CMSIS I2C Slave">
         <description>I2C Slave Interface</description>
         <require condition="MAX3263X CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

<!--      <condition id="MAX32631 CMSIS MAA">
         <description>Modular Arithmetic Accelerator</description>
         <require condition="MAX3263X CMSIS-CORE"/>
         <require Dname="MAX32631"/>
      </condition>
-->
      <condition id="MAX32630 CMSIS 1-Wire">
         <description>1-Wire Master Interface</description>
         <require condition="MAX3263X CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32630 CMSIS PMU">
         <description>Peripheral Management Unit for DMA</description>
         <require condition="MAX3263X CMSIS-CORE"/>
      </condition>

      <condition id="MAX32630 CMSIS Pulse Train">
         <description>Pulse Train (PWM) Controller</description>
         <require condition="MAX3263X CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32630 CMSIS RTC">
         <description>Real Time Clock</description>
         <require condition="MAX3263X CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32630 CMSIS Flash IAP">
         <description>In-Application Flash Programming</description>
         <require condition="MAX3263X CMSIS-CORE"/>
      </condition>

      <condition id="MAX32630 CMSIS SPI Master">
         <description>SPI Master Interface</description>
         <require condition="MAX3263X CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32630 CMSIS SPI Slave">
         <description>SPI Slave Interface</description>
         <require condition="MAX3263X CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32630 CMSIS SPI XIP">
         <description>SPI eXecute In Place</description>
         <require condition="MAX3263X CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32630 CMSIS TIMER">
         <description>32/16-Bit Timers</description>
         <require condition="MAX3263X CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32630 CMSIS WDT1">
         <description>Watchdog Timer 1</description>
         <require condition="MAX3263X CMSIS-CORE"/>
      </condition>

      <condition id="MAX32630 CMSIS WDT2">
         <description>Watchdog Timer 2</description>
         <require condition="MAX3263X CMSIS-CORE"/>
      </condition>

      <condition id="MAX32630 CMSIS UART">
         <description>UART</description>
         <require condition="MAX3263X CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
      </condition>

      <condition id="MAX32630 BSP">
         <description>Board Support Package</description>
         <require condition="MAX3263X CMSIS-CORE"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
         <require Cclass="HAL" Cgroup="Hardware Access Layer"/>
         <require Cclass="Communications" Cgroup="SPI Master"/>
         <require Cclass="Communications" Cgroup="I2C Master"/>
         <require Cclass="Communications" Cgroup="UART"/>
      </condition>

      <condition id="Maxim USB">
         <description>MAXUSB Libraries</description>
         <require Dvendor="Maxim:23"/>
         <require Cclass="Peripherals" Cgroup="GPIO"/>
         <require Cclass="HAL" Cgroup="Hardware Access Layer"/>
      </condition>

