glcloud/keil_v5/ARM/PACK/.Web/Maxim.MAX32630.pdsc
   </conditions>

   <components>
      <component Cclass="Device" Cgroup="Startup" Cversion="0.0.1-a" condition="MAX32630 Device">
         <description>System Startup for Maxim MAX32630 Microcontroller</description>
         <files>
            <file category="include" name="Libraries/Device/Maxim/MAX3263X/Include/"/>
            <file category="include" name="Libraries/MAX3263XPeriphDriver/Include/"/>
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX3263X/Source/ARM/startup_max3263x.s" version="0.0.1" condition="Startup ARM"/>
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX3263X/Source/GCC/startup_max3263x.S" version="0.0.1" condition="Startup GCC"/>
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX3263X/Source/IAR/startup_max3263x.s" version="0.0.1" condition="Startup IAR"/>
            <file category="sourceC" attr="config" name="Libraries/Device/Maxim/MAX3263X/Source/IAR/low_level_init.c" version="0.0.1" condition="Startup IAR"/>
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX3263X/Source/IAR/cmain.s" version="0.0.1" condition="Startup IAR"/>
            <file category="sourceC" attr="config" name="Libraries/Device/Maxim/MAX3263X/Source/system_max3263x.c" version="0.0.1" />
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/nvic_table.c" version="0.0.1"/>
            <file category="header" attr="config" name="Libraries/Device/Maxim/MAX3263X/Include/max3263x.h" version="0.0.1" />
         </files>
      </component>

      <component Cclass="Device" Cgroup="Startup" Cversion="0.0.1-a" condition="MAX32631 Device">
         <description>System Startup for Maxim MAX32631 Microcontroller</description>
         <files>
            <file category="include" name="Libraries/Device/Maxim/MAX3263X/Include/"/>
            <file category="include" name="Libraries/MAX3263XPeriphDriver/Include/"/>
            <file category="sourceAsm" name="Libraries/Device/Maxim/MAX3263X/Source/ARM/startup_max3263x.s" version="0.0.1" attr="config" condition="Startup ARM"/>
            <file category="sourceAsm" name="Libraries/Device/Maxim/MAX3263X/Source/GCC/startup_max3263x.S" version="0.0.1" attr="config" condition="Startup GCC"/>
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX3263X/Source/IAR/startup_max3263x.s" version="0.0.1" condition="Startup IAR"/>
            <file category="sourceC" attr="config" name="Libraries/Device/Maxim/MAX3263X/Source/IAR/low_level_init.c" version="0.0.1" condition="Startup IAR"/>
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX3263X/Source/IAR/cmain.s" version="0.0.1" condition="Startup IAR"/>
            <file category="sourceC" attr="config" name="Libraries/Device/Maxim/MAX3263X/Source/system_max3263x.c" version="0.0.1"/>
            <file category="sourceC" attr="config" name="Libraries/MAX3263XPeriphDriver/Source/nvic_table.c" version="0.0.1"/>
            <file category="header" name="Libraries/Device/Maxim/MAX3263X/Include/max3263x.h" version="0.0.1"/>
         </files>
      </component>

      <component Cclass="HAL" Cgroup="Hardware Access Layer" Cversion="0.0.1-a" condition="MAX3263X CMSIS-CORE">
         <description>Hardware Access Layer and System Configuration</description>
         <files>
            <file category="header" attr="config" name="Libraries/Device/Maxim/MAX3263X/Include/max3263x.h" version="0.0.1"/>
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/clkman.c" version="0.0.1"/>
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/flc.c" version="0.0.1"/>
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/icc.c" version="0.0.1"/>
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/lp.c" version="0.0.1"/>
            <file category="header" attr="config" name="Libraries/MAX3263XPeriphDriver/Include/mxc_config.h" version="0.0.1" />
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/mxc_assert.c" version="0.0.1"/>
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/mxc_lock.c" version="0.0.1"/>
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/mxc_sys.c" version="0.0.1"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="ADC" Cversion="0.0.1-a" condition="MAX32630 CMSIS ADC">
         <description>ADC Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/adc.c" version="0.0.1"/>
         </files>
      </component>

      <component Cclass="Trust Protection Unit" Cgroup="AES" Cversion="0.0.1-a" condition="MAX32630 CMSIS AES">
         <description>AES Hardware Engine</description>
         <files>
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/aes.c" version="0.0.1"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="CRC" Cversion="0.0.1-a" condition="MAX32630 CMSIS CRC">
         <description>CRC Engine</description>
         <files>
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/crc.c" version="0.0.1"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="GPIO" Cversion="0.0.1-a" condition="MAX32630 CMSIS GPIO">
         <description>GPIO</description>
         <files>
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/gpio.c" version="0.0.1"/>
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/ioman.c" version="0.0.1"/>
        </files>
      </component>

      <component Cclass="Communications" Cgroup="I2C Master" Cversion="0.0.1-a" condition="MAX32630 CMSIS I2C Master">
         <description>I2C Master Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/i2cm.c" version="0.0.1"/>
         </files>
      </component>

      <component Cclass="Communications" Cgroup="I2C Slave" Cversion="0.0.1-a" condition="MAX32630 CMSIS I2C Slave">
         <description>I2C Slave Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/i2cs.c" version="0.0.1"/>
         </files>
      </component>

